# StructuralFoundationThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralFoundationThickness Property
ParameterTypeId Class See Also
---
"Foundation Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralFoundationThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralFoundationThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralFoundationThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace